Tekla.Structures.Solid.Edge.EdgeTypeEnum
The type of the edge.

Tekla.Structures.Solid.Edge.EdgeTypeEnum.EDGE_TYPE_NORMAL
The normal edge type.

Tekla.Structures.Solid.Edge.EdgeTypeEnum.EDGE_TYPE_CURVED_SURFACE
The curved surface edge type.

Tekla.Structures.Solid.Edge.EdgeTypeEnum.EDGE_TYPE_HIDDEN
The hidden edge type.